{
  "projects": [
    {
      "id": 1,
      "title": "LeafBank",
      "shortdesc": "An iOS Application for logging and surveying medical usage to aid in the research of cannabis",
      "description": "This app was created with a team of 5 for a class called 'iProgramming for Creative Minds'. In the class we were given the chance to build apps for real clients with regular meetings and deadlines. The objective of this app was to survey and log medication usage to be used for research. This class taught me many skills including programming in Swift, prototyping in Sketch and InVision, and designing an effective User Experience for the client ",
      "technologies": "Swift, Xcode, Firebase, Sketch, InVision",
      "github": "unavailable",
      "images": ["LeafBank1", "LeafBank2", "LeafBank3", "LeafBank4"],
      "demo": ""
    },
    {
      "id": 2,
      "title": "MatrixVision",
      "shortdesc": "A Web Application that takes a users webcam video and manipulates the pixels to create a matrix-like filter",
      "description": "Originally this was a final project I did for an Art class on Net Art, done entirely in javascript. But I decided to exercise my newly gained knowledge and convert it to a React application. In doing so I learned how to split up a project into components and the React lifecycle",
      "technologies": "React, Javascript, HTML5, CSS",
      "github": "https://github.com/SteveLeong/MatrixVision",
      "images": ["Matrix1"],
      "demo": "https://steveleong.github.io/MatrixVision/"
    },
    {
      "id": 3,
      "title": "Critix",
      "shortdesc": "A Web Application that allows photographers and digital illustrators to share and critic works of other content creators",
      "description": "This application was created with a team of 4. Critix is an image hosting application, similar to Instagram, designed for a specific kind of audience: creators who are looking for constructive criticism about their works. Users could upload images as well as comment on others posts in real time. And we created this all in one week!",
      "technologies": "Embedded JavaScript, HTML5, Materialize CSS, MongoDB + Mongoose, Node.js, Express.js",
      "github": "https://github.com/joshquines/Critix",
      "images": ["Critix1", "Critix2", "Critix3", "Critix4", "Critix5"],
      "demo": ""
    },
    {
      "id": 4,
      "title": "Library Kiosk App",
      "shortdesc": "A Windows Application to replace the current outdated systems libraries use today.",
      "description": "This application was created by me and 3 others in a Human-Computer Interactions course. Since this was my first experience in web development this course taught me the basics of design such as the different design methods, prototyping, usability testing, and the important of connecting with users. During the design process I went to local Libraries and interviewed people about their experience with the current system and used that data to further enhance the user experience ",
      "technologies": "XAML, Visual Studio",
      "github": "https://github.com/jglem/HCILibrary",
      "images": ["Library1", "Library2", "Library3", "Library4"],
      "demo": ""
    },
    {
      "id": 5,
      "title": "Import Car DB",
      "shortdesc": "A database designed and implemented from scratch",
      "description": "This website was made by me and 2 others for a Database class. I gained experience creating my own Database using MySQL and although the website was not the main point of this project I gained experience in using php to connect my database with my website.",
      "technologies": "MySQL, PHP, Javascript, CSS, HTML",
      "github": "https://github.com/SteveLeong/ImportCarsDB",
      "images": ["ImportCar1", "ImportCar2", "ImportCar3"],
      "demo": ""
    }
  ]
}
